ROH/app/models/user.rb

INSERT INTO "heros" ("level", "exp", "str", "dex", "kno", "cha", "vit", "def", "created_at", "updated_at", "user_id", "skill_point", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def gen_hero1
    Hero.create!(
      name: "noob1",
      level: 1,
      exp: 0,
      str: 1,
      dex: 1,
      kno: 1,
      cha: 1,
      vit: 1,
      def: 1,
      user: self,
      skill_point: 7,
    )

INSERT INTO "heros" ("level", "exp", "str", "dex", "kno", "cha", "vit", "def", "created_at", "updated_at", "user_id", "skill_point", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def gen_hero2
    Hero.create!(
      name: "noob2",
      level: 1,
      exp: 0,
      str: 1,
      dex: 1,
      kno: 1,
      cha: 1,
      vit: 1,
      def: 1,
      user: self,
      skill_point: 7,
    )

INSERT INTO "heros" ("level", "exp", "str", "dex", "kno", "cha", "vit", "def", "created_at", "updated_at", "user_id", "skill_point", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def gen_hero3
    Hero.create!(
      name: "noob3",
      level: 1,
      exp: 0,
      str: 1,
      dex: 1,
      kno: 1,
      cha: 1,
      vit: 1,
      def: 1,
      user: self,
      skill_point: 7,
    )