ROH/app/controllers/heros_controller.rb

  def index
    @heros = Hero.all
---
SELECT "heros".* FROM "heros"

  def create
    @hero = Hero.new(hero_params)

    if @hero.save
---
INSERT INTO "heros" ("level", "exp", "str", "dex", "kno", "cha", "vit", "def", "created_at", "updated_at", "user_id", "skill_point", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    if @hero.update(hero_params)
---
UPDATE "heros" SET "vit" = $1, "def" = $2, "skill_point" = $3, "updated_at" = $4 WHERE "heros"."id" = $5  [["vit", 2], ["def", 2], ["skill_point", 3], ["updated_at", "2019-10-11 06:10:24.060402"], ["id", 2]]

  def destroy
    @hero.destroy
---
DELETE FROM "heros" WHERE "heros"."id" = $1  [["id", 1]]

    def set_hero
      @hero = Hero.find(params[:id])
---
SELECT "heros".* FROM "heros" WHERE "heros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]